_posts/2015-06-29-Getting-Emacs-to-read-to-me.html
---
title: Getting Emacs to read to me
date: 2015/06/29 14:56:16
updated: 2015/06/29 14:56:16
categories: emacs
tags: 
---



<p>
I thought it would be interesting to have Emacs read text on the screen. Why? Sometimes I get tired of reading ;) Seriously though, this has applications in accessibility, learning to read, translation, taking a break from looking at the screen, reading emails out loud, fun and games, etc&#x2026; Seems like a worthwhile endeavor!
</p>

<p>
You may want to see this video: <a href="https://www.youtube.com/watch?v=8bgS8yDSkXw">https://www.youtube.com/watch?v=8bgS8yDSkXw</a> to hear how it works.
</p>

<p>
On a Mac, it turns out to be easy to get a voice with a little applescript:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(do-applescript <span style="color: #008000;">"say \"Hello John\" using \"Victoria\""</span>)
</pre>
</div>

<p>
Interesting idea to integrate some feedback into Emacs-lisp functions! at least if you are on a Mac. All we need are some interactive functions that grab text, and pass them to the applescript with an appropriate amount of escaping any quotes and backslashes.
</p>

<p>
Here is a function to speak the word at point, or selected region, or the text passed to the function:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">defvar</span> <span style="color: #BA36A5;">words-voice</span> <span style="color: #008000;">"Vicki"</span>
  <span style="color: #036A07;">"Mac voice to use for speaking."</span>)

(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">words-speak</span> (<span style="color: #6434A3;">&amp;optional</span> text)
  <span style="color: #036A07;">"Speak word at point or region. Mac only."</span>
  (<span style="color: #0000FF;">interactive</span>)
  (<span style="color: #0000FF;">unless</span> text
    (<span style="color: #0000FF;">setq</span> text (<span style="color: #0000FF;">if</span> (use-region-p)
                   (buffer-substring
                    (region-beginning) (region-end))
                 (thing-at-point 'word))))
  <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">escape some special applescript chars</span>
  (<span style="color: #0000FF;">setq</span> text (replace-regexp-in-string <span style="color: #008000;">"\\\\"</span> <span style="color: #008000;">"\\\\\\\\"</span> text))
  (<span style="color: #0000FF;">setq</span> text (replace-regexp-in-string <span style="color: #008000;">"\""</span> <span style="color: #008000;">"\\\\\""</span> text))
  (do-applescript
   (format
    <span style="color: #008000;">"say \"%s\" using \"%s\""</span>
    text
    words-voice)))
</pre>
</div>

<pre class="example">
words-speak
</pre>

<p>
Now we can write:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(words-speak <span style="color: #008000;">"Hello John"</span>)
</pre>
</div>

<p>
One reason I wrote this is to read org-files to me. So, now we write some functions to read words, sentences and paragraphs. These are all syntactic units in Emacs. We write code to enable us to read the next or previous units with the prefix args. Finally,  we bind the commands to some keys and a hydra for fun.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">setq</span> sentence-end-double-space nil)

(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">mac-say-word</span> (<span style="color: #6434A3;">&amp;optional</span> arg)
  <span style="color: #036A07;">"Speak word at point. With ARG, go forward ARG words."</span>
  (<span style="color: #0000FF;">interactive</span> <span style="color: #008000;">"P"</span>)
  <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">arg can be (4), 4, "-", or -1. we handle these like this.</span>
  (<span style="color: #0000FF;">let</span> ((newarg))
    (<span style="color: #0000FF;">when</span> arg
      (<span style="color: #0000FF;">setq</span> newarg (<span style="color: #0000FF;">cond</span>
                    ((listp arg)
                     (round (log (car arg) 4)))
                    ((<span style="color: #0000FF;">and</span> (stringp arg) (string= <span style="color: #008000;">"-"</span> arg))
                     ((&lt; 0 arg) arg)
                     -1)
                    (t arg)))
      (forward-word newarg))
    (<span style="color: #0000FF;">when</span> (thing-at-point 'word)
      (words-speak (thing-at-point 'word)))))

(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">mac-say-sentence</span> (<span style="color: #6434A3;">&amp;optional</span> arg)
  <span style="color: #036A07;">"Speak sentence at point. With ARG, go forward ARG sentences."</span>
  (<span style="color: #0000FF;">interactive</span> <span style="color: #008000;">"P"</span>)
  <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">arg can be (4), 4, "-", or -1. we handle these like this.</span>
  (<span style="color: #0000FF;">let</span> ((newarg))
    (<span style="color: #0000FF;">when</span> arg
      (<span style="color: #0000FF;">setq</span> newarg (<span style="color: #0000FF;">cond</span>
                    ((listp arg)
                     (round (log (car arg) 4)))
                    ((<span style="color: #0000FF;">and</span> (stringp arg) (string= <span style="color: #008000;">"-"</span> arg))
                     ((&lt; 0 arg) arg)
                     -1)
                    (t arg)))
      (forward-sentence newarg)
      (<span style="color: #0000FF;">when</span> (&lt; 0 newarg) (forward-word)))
    (<span style="color: #0000FF;">when</span> (thing-at-point 'sentence)
      (words-speak (thing-at-point 'sentence)))))

(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">mac-say-paragraph</span> (<span style="color: #6434A3;">&amp;optional</span> arg)
  <span style="color: #036A07;">"Speak paragraph at point. With ARG, go forward ARG paragraphs."</span>
  (<span style="color: #0000FF;">interactive</span> <span style="color: #008000;">"P"</span>)
  <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">arg can be (4), 4, "-", or -1. we handle these like this.</span>
  (<span style="color: #0000FF;">let</span> ((newarg))
    (<span style="color: #0000FF;">when</span> arg
      (<span style="color: #0000FF;">setq</span> newarg (<span style="color: #0000FF;">cond</span>
                    ((listp arg)
                     (round (log (car arg) 4)))
                    ((<span style="color: #0000FF;">and</span> (stringp arg) (string= <span style="color: #008000;">"-"</span> arg))
                     ((&lt; 0 arg) arg)
                     -1)
                    (t arg)))
      (forward-paragraph newarg)
      (<span style="color: #0000FF;">when</span> (&lt; 0 newarg) (forward-word)))
    (<span style="color: #0000FF;">when</span> (thing-at-point 'paragraph)
      (words-speak (thing-at-point 'paragraph)))))
</pre>
</div>

<pre class="example">
mac-say-paragraph
</pre>

<p>
Now for some key-bindings. I will make a hydra that allows repeating commands, and a keymap for more direct function calls.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">defhydra</span> mac-speak (<span style="color: #006FE0;">:color</span> red)
  <span style="color: #008000;">"word speak"</span>
  (<span style="color: #008000;">"w"</span> (<span style="color: #0000FF;">progn</span> (mac-say-word) (forward-word)) <span style="color: #008000;">"Next word"</span>)
  (<span style="color: #008000;">"W"</span> (mac-say-word -1) <span style="color: #008000;">"Previous word"</span>)
  (<span style="color: #008000;">"s"</span> (<span style="color: #0000FF;">progn</span> (mac-say-sentence) (forward-sentence)(forward-word)) <span style="color: #008000;">"Next sentence"</span>)
  (<span style="color: #008000;">"S"</span> (mac-say-sentence -1) <span style="color: #008000;">"Previous sentence"</span>)
  (<span style="color: #008000;">"p"</span> (<span style="color: #0000FF;">progn</span> (mac-say-paragraph) (forward-paragraph)) <span style="color: #008000;">"Next paragraph"</span>)
  (<span style="color: #008000;">"P"</span> (mac-say-paragraph -1) <span style="color: #008000;">"Previous paragraph"</span>))

(define-prefix-command 'mac-speak-keymap)
(define-key mac-speak-keymap (vector ?w) 'mac-say-word)
(define-key mac-speak-keymap (vector ?s) 'mac-say-sentence)
(define-key mac-speak-keymap (vector ?p) 'mac-say-paragraph)
(define-key mac-speak-keymap (vector ?h) 'mac-speak/body)
(global-set-key (kbd <span style="color: #008000;">"\C-xr"</span>) 'mac-speak-keymap)
</pre>
</div>

<pre class="example">
mac-speak-keymap
</pre>

<p>
Now, I can navigate text and have my Mac read it to me. It isn't quite like hearing a real person read it, but it is not too bad either. When you need a break from reading, this might be a nice tool!
</p>
<p>Copyright (C) 2015 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2015/06/29/Getting-Emacs-to-read-to-me.org">org-mode source</a><p><p>Org-mode version = 8.2.10</p>